FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/scu_reg.h
     * |        |          |0 = The counter will be halted when the core processor is halted by ICE. (default)
     * |        |          |1 = The counter will keep counting when the core processor is halted by ICE.
     * @var SCU_T::NSMLOAD
     * Offset: 0x204  Non-secure State Monitor Reload Value Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[23:0]  |RELOAD    |Reload Value for Non-secure State Monitor Counter
     * |        |          |The RELOAD value will be reloaded to the counter whenever the counter counts down to 0.
     * @var SCU_T::NSMVAL
     * Offset: 0x208  Non-secure State Monitor Counter Value Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[23:0]  |VALUE     |Counter Value of Non-secure State Monitor Counter
     * |        |          |Current value of non-secure state monitor counter
     * |        |          |This is down counter and counts down only when CURRNS = 1
     * |        |          |When counting down to 0, VALUE will automatically be reloaded from NSMLOAD register.
     * |        |          |A write of any value clears the VALUE to 0 and also clears NSMIF.
     * @var SCU_T::NSMSTS
     * Offset: 0x20C  Non-secure State Monitor Status Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |CURRNS    |Current Core Processor Secure/Non-secure State
     * |        |          |0 = Core processor is in secure state.
     * |        |          |1 = Core processor is in non-secure state.
     * |        |          |Note: This bit can be used to monitor the current secure/non-secure state of the core processor, even if the non-secure state monitor counter is disabled.
     * |[1]     |NSMIF     |Non-secure State Monitor Interrupt Flag
     * |        |          |0 = Counter doesnu2019t count down to 0 since the last NSMIF has been cleared.
     * |        |          |1 = Counter counts down to 0.
     * |        |          |Note: This bit is cleared by writing 1.
     */
    __IO uint32_t PNSSET[ 7 ]; /*!< [0x0000~0X0018] Peripheral Non-secure Attribution Set Register0 (0x4000_0000~0x4001_FFFF) */
    __I uint32_t RESERVE0[ 1 ];
    __IO uint32_t IONSSET;     /*!< [0x0020] IO Non-secure Attribution Set Register                           */
    __IO uint32_t SRAMNSSET;   /*!< [0x0024] SRAM Non-secure Attribution Set Register                         */
    __I uint32_t FNSADDR;      /*!< [0x0028] Flash Non-secure Boundary Address Register                       */
    __IO uint32_t SVIOIEN;     /*!< [0x002c] Security Violation Interrupt Enable Register                     */
    __IO uint32_t SVINTSTS;    /*!< [0x0030] Security Violation Interrupt Status Register                     */
    __I uint32_t APB0VSRC;     /*!< [0x0034] APB0 Security Policy Violation Source                            */
    __I uint32_t APB0VA;       /*!< [0x0038] APB0 Violation Address                                           */
    __I uint32_t APB1VSRC;     /*!< [0x003c] APB1 Security Policy Violation Source                            */
    __I uint32_t APB1VA;       /*!< [0x0040] APB1 Violation Address                                           */
    __I uint32_t GPIOVSRC;     /*!< [0x0044] GPIO Security Policy Violation Source                            */
    __I uint32_t GPIOVA;       /*!< [0x0048] GPIO Violation Address                                           */
    __I uint32_t EBIVSRC;      /*!< [0x004c] EBI Security Policy Violation Source                             */
    __I uint32_t EBIVA;        /*!< [0x0050] EBI Violation Address                                            */
    __I uint32_t USBHVSRC;     /*!< [0x0054] USBH Security Policy Violation Source                            */
    __I uint32_t USBHVA;       /*!< [0x0058] USBH Violation Address                                           */
    __I uint32_t CRCVSRC;      /*!< [0x005c] CRC Security Policy Violation Source                             */
    __I uint32_t CRCVA;        /*!< [0x0060] CRC Violation Address                                            */
    __I uint32_t SD0VSRC;      /*!< [0x0064] SDH0 Security Policy Violation Source                            */
    __I uint32_t SD0VA;        /*!< [0x0068] SDH0 Violation Address                                           */
    __I uint32_t RESERVE1[ 2 ];
    __I uint32_t PDMA0VSRC;    /*!< [0x0074] PDMA0 Security Policy Violation Source                           */
    __I uint32_t PDMA0VA;      /*!< [0x0078] PDMA0 Violation Address                                          */
    __I uint32_t PDMA1VSRC;    /*!< [0x007c] PDMA1 Security Policy Violation Source                           */
    __I uint32_t PDMA1VA;      /*!< [0x0080] PDMA1 Violation Address                                          */
    __I uint32_t SRAM0VSRC;    /*!< [0x0084] SRAM0 Security Policy Violation Source                           */
    __I uint32_t SRAM0VA;      /*!< [0x0088] SRAM0 Violation Address                                          */
    __I uint32_t SRAM1VSRC;    /*!< [0x008c] SRAM1 Security Policy Violation Source                           */
    __I uint32_t SRAM1VA;      /*!< [0x0090] SRAM1 Violation Address                                          */
    __I uint32_t FMCVSRC;      /*!< [0x0094] FMC Security Policy Violation Source                             */
    __I uint32_t FMCVA;        /*!< [0x0098] FMC Violation Address                                            */
    __I uint32_t FLASHVSRC;    /*!< [0x009c] Flash Security Policy Violation Source                           */
    __I uint32_t FLASHVA;      /*!< [0x00a0] Flash Violation Address                                          */
    __I uint32_t SCUVSRC;      /*!< [0x00a4] SCU Security Policy Violation Source                             */
    __I uint32_t SCUVA;        /*!< [0x00a8] SCU Violation Address                                            */
    __I uint32_t SYSVSRC;      /*!< [0x00ac] System Security Policy Violation Source                          */
    __I uint32_t SYSVA;        /*!< [0x00b0] System Violation Address                                         */
    __I uint32_t CRPTVSRC;     /*!< [0x00b4] Crypto Security Policy Violation Source                          */
    __I uint32_t CRPTVA;       /*!< [0x00b8] Crypto Violation Address                                         */
    __I uint32_t RESERVE2[ 81 ];
    __IO uint32_t NSMCTL;      /*!< [0x0200] Non-secure State Monitor Control Register                        */
    __IO uint32_t NSMLOAD;     /*!< [0x0204] Non-secure State Monitor Reload Value Register                   */
    __IO uint32_t NSMVAL;      /*!< [0x0208] Non-secure State Monitor Counter Value Register                  */
    __IO uint32_t NSMSTS;      /*!< [0x020c] Non-secure State Monitor Status Register                         */
} SCU_T;

/**
 *  @addtogroup SCU_CONST SCU Bit Field Definition
 *  Constant Definitions for SCU Controller
 * @{ */

#define SCU_PNSSET0_USBH_Pos        ( 9 )                                                  /*!< SCU_T::PNSSET0: USBH Position          */
#define SCU_PNSSET0_USBH_Msk        ( 0x1ul << SCU_PNSSET0_USBH_Pos )                      /*!< SCU_T::PNSSET0: USBH Mask              */

#define SCU_PNSSET0_SDH0_Pos        ( 13 )                                                 /*!< SCU_T::PNSSET0: SDH0 Position          */
#define SCU_PNSSET0_SDH0_Msk        ( 0x1ul << SCU_PNSSET0_SDH0_Pos )                      /*!< SCU_T::PNSSET0: SDH0 Mask              */

