FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/scu_reg.h
#define SCU_PNSSET0_EBI_Pos         ( 16 )                                                 /*!< SCU_T::PNSSET0: EBI Position           */
#define SCU_PNSSET0_EBI_Msk         ( 0x1ul << SCU_PNSSET0_EBI_Pos )                       /*!< SCU_T::PNSSET0: EBI Mask               */

#define SCU_PNSSET0_PDMA1_Pos       ( 24 )                                                 /*!< SCU_T::PNSSET0: PDMA1 Position         */
#define SCU_PNSSET0_PDMA1_Msk       ( 0x1ul << SCU_PNSSET0_PDMA1_Pos )                     /*!< SCU_T::PNSSET0: PDMA1 Mask             */

#define SCU_PNSSET1_CRC_Pos         ( 17 )                                                 /*!< SCU_T::PNSSET1: CRC Position           */
#define SCU_PNSSET1_CRC_Msk         ( 0x1ul << SCU_PNSSET1_CRC_Pos )                       /*!< SCU_T::PNSSET1: CRC Mask               */

#define SCU_PNSSET1_CRPT_Pos        ( 18 )                                                 /*!< SCU_T::PNSSET1: CRPT Position          */
#define SCU_PNSSET1_CRPT_Msk        ( 0x1ul << SCU_PNSSET1_CRPT_Pos )                      /*!< SCU_T::PNSSET1: CRPT Mask              */

#define SCU_PNSSET2_RTC_Pos         ( 1 )                                                  /*!< SCU_T::PNSSET2: RTC Position           */
#define SCU_PNSSET2_RTC_Msk         ( 0x1ul << SCU_PNSSET2_RTC_Pos )                       /*!< SCU_T::PNSSET2: RTC Mask               */

#define SCU_PNSSET2_EADC_Pos        ( 3 )                                                  /*!< SCU_T::PNSSET2: EADC Position          */
#define SCU_PNSSET2_EADC_Msk        ( 0x1ul << SCU_PNSSET2_EADC_Pos )                      /*!< SCU_T::PNSSET2: EADC Mask              */

#define SCU_PNSSET2_ACMP01_Pos      ( 5 )                                                  /*!< SCU_T::PNSSET2: ACMP01 Position        */
#define SCU_PNSSET2_ACMP01_Msk      ( 0x1ul << SCU_PNSSET2_ACMP01_Pos )                    /*!< SCU_T::PNSSET2: ACMP01 Mask            */

#define SCU_PNSSET2_DAC_Pos         ( 7 )                                                  /*!< SCU_T::PNSSET2: DAC Position           */
#define SCU_PNSSET2_DAC_Msk         ( 0x1ul << SCU_PNSSET2_DAC_Pos )                       /*!< SCU_T::PNSSET2: DAC Mask               */

#define SCU_PNSSET2_I2S0_Pos        ( 8 )                                                  /*!< SCU_T::PNSSET2: I2S0 Position          */
#define SCU_PNSSET2_I2S0_Msk        ( 0x1ul << SCU_PNSSET2_I2S0_Pos )                      /*!< SCU_T::PNSSET2: I2S0 Mask              */

#define SCU_PNSSET2_OTG_Pos         ( 13 )                                                 /*!< SCU_T::PNSSET2: OTG Position           */
#define SCU_PNSSET2_OTG_Msk         ( 0x1ul << SCU_PNSSET2_OTG_Pos )                       /*!< SCU_T::PNSSET2: OTG Mask               */

#define SCU_PNSSET2_TMR23_Pos       ( 17 )                                                 /*!< SCU_T::PNSSET2: TMR23 Position         */
#define SCU_PNSSET2_TMR23_Msk       ( 0x1ul << SCU_PNSSET2_TMR23_Pos )                     /*!< SCU_T::PNSSET2: TMR23 Mask             */

#define SCU_PNSSET2_EPWM0_Pos       ( 24 )                                                 /*!< SCU_T::PNSSET2: EPWM0 Position         */
#define SCU_PNSSET2_EPWM0_Msk       ( 0x1ul << SCU_PNSSET2_EPWM0_Pos )                     /*!< SCU_T::PNSSET2: EPWM0 Mask             */

#define SCU_PNSSET2_EPWM1_Pos       ( 25 )                                                 /*!< SCU_T::PNSSET2: EPWM1 Position         */
#define SCU_PNSSET2_EPWM1_Msk       ( 0x1ul << SCU_PNSSET2_EPWM1_Pos )                     /*!< SCU_T::PNSSET2: EPWM1 Mask             */

#define SCU_PNSSET2_BPWM0_Pos       ( 26 )                                                 /*!< SCU_T::PNSSET2: BPWM0 Position         */
#define SCU_PNSSET2_BPWM0_Msk       ( 0x1ul << SCU_PNSSET2_BPWM0_Pos )                     /*!< SCU_T::PNSSET2: BPWM0 Mask             */

#define SCU_PNSSET2_BPWM1_Pos       ( 27 )                                                 /*!< SCU_T::PNSSET2: BPWM1 Position         */
#define SCU_PNSSET2_BPWM1_Msk       ( 0x1ul << SCU_PNSSET2_BPWM1_Pos )                     /*!< SCU_T::PNSSET2: BPWM1 Mask             */

#define SCU_PNSSET3_QSPI0_Pos       ( 0 )                                                  /*!< SCU_T::PNSSET3: QSPI0 Position         */
#define SCU_PNSSET3_QSPI0_Msk       ( 0x1ul << SCU_PNSSET3_QSPI0_Pos )                     /*!< SCU_T::PNSSET3: QSPI0 Mask             */

#define SCU_PNSSET3_SPI0_Pos        ( 1 )                                                  /*!< SCU_T::PNSSET3: SPI0 Position          */
#define SCU_PNSSET3_SPI0_Msk        ( 0x1ul << SCU_PNSSET3_SPI0_Pos )                      /*!< SCU_T::PNSSET3: SPI0 Mask              */

#define SCU_PNSSET3_SPI1_Pos        ( 2 )                                                  /*!< SCU_T::PNSSET3: SPI1 Position          */
#define SCU_PNSSET3_SPI1_Msk        ( 0x1ul << SCU_PNSSET3_SPI1_Pos )                      /*!< SCU_T::PNSSET3: SPI1 Mask              */

#define SCU_PNSSET3_SPI2_Pos        ( 3 )                                                  /*!< SCU_T::PNSSET3: SPI2 Position          */
#define SCU_PNSSET3_SPI2_Msk        ( 0x1ul << SCU_PNSSET3_SPI2_Pos )                      /*!< SCU_T::PNSSET3: SPI2 Mask              */

#define SCU_PNSSET3_SPI3_Pos        ( 4 )                                                  /*!< SCU_T::PNSSET3: SPI3 Position          */
#define SCU_PNSSET3_SPI3_Msk        ( 0x1ul << SCU_PNSSET3_SPI3_Pos )                      /*!< SCU_T::PNSSET3: SPI3 Mask              */

#define SCU_PNSSET3_UART0_Pos       ( 16 )                                                 /*!< SCU_T::PNSSET3: UART0 Position         */
#define SCU_PNSSET3_UART0_Msk       ( 0x1ul << SCU_PNSSET3_UART0_Pos )                     /*!< SCU_T::PNSSET3: UART0 Mask             */

#define SCU_PNSSET3_UART1_Pos       ( 17 )                                                 /*!< SCU_T::PNSSET3: UART1 Position         */
#define SCU_PNSSET3_UART1_Msk       ( 0x1ul << SCU_PNSSET3_UART1_Pos )                     /*!< SCU_T::PNSSET3: UART1 Mask             */

#define SCU_PNSSET3_UART2_Pos       ( 18 )                                                 /*!< SCU_T::PNSSET3: UART2 Position         */
#define SCU_PNSSET3_UART2_Msk       ( 0x1ul << SCU_PNSSET3_UART2_Pos )                     /*!< SCU_T::PNSSET3: UART2 Mask             */

#define SCU_PNSSET3_UART3_Pos       ( 19 )                                                 /*!< SCU_T::PNSSET3: UART3 Position         */
#define SCU_PNSSET3_UART3_Msk       ( 0x1ul << SCU_PNSSET3_UART3_Pos )                     /*!< SCU_T::PNSSET3: UART3 Mask             */

