FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/scu_reg.h
#define SCU_PNSSET3_UART4_Pos       ( 20 )                                                 /*!< SCU_T::PNSSET3: UART4 Position         */
#define SCU_PNSSET3_UART4_Msk       ( 0x1ul << SCU_PNSSET3_UART4_Pos )                     /*!< SCU_T::PNSSET3: UART4 Mask             */

#define SCU_PNSSET3_UART5_Pos       ( 21 )                                                 /*!< SCU_T::PNSSET3: UART5 Position         */
#define SCU_PNSSET3_UART5_Msk       ( 0x1ul << SCU_PNSSET3_UART5_Pos )                     /*!< SCU_T::PNSSET3: UART5 Mask             */

#define SCU_PNSSET4_I2C0_Pos        ( 0 )                                                  /*!< SCU_T::PNSSET4: I2C0 Position          */
#define SCU_PNSSET4_I2C0_Msk        ( 0x1ul << SCU_PNSSET4_I2C0_Pos )                      /*!< SCU_T::PNSSET4: I2C0 Mask              */

#define SCU_PNSSET4_I2C1_Pos        ( 1 )                                                  /*!< SCU_T::PNSSET4: I2C1 Position          */
#define SCU_PNSSET4_I2C1_Msk        ( 0x1ul << SCU_PNSSET4_I2C1_Pos )                      /*!< SCU_T::PNSSET4: I2C1 Mask              */

#define SCU_PNSSET4_I2C2_Pos        ( 2 )                                                  /*!< SCU_T::PNSSET4: I2C2 Position          */
#define SCU_PNSSET4_I2C2_Msk        ( 0x1ul << SCU_PNSSET4_I2C2_Pos )                      /*!< SCU_T::PNSSET4: I2C2 Mask              */

#define SCU_PNSSET4_SC0_Pos         ( 16 )                                                 /*!< SCU_T::PNSSET4: SC0 Position           */
#define SCU_PNSSET4_SC0_Msk         ( 0x1ul << SCU_PNSSET4_SC0_Pos )                       /*!< SCU_T::PNSSET4: SC0 Mask               */

#define SCU_PNSSET4_SC1_Pos         ( 17 )                                                 /*!< SCU_T::PNSSET4: SC1 Position           */
#define SCU_PNSSET4_SC1_Msk         ( 0x1ul << SCU_PNSSET4_SC1_Pos )                       /*!< SCU_T::PNSSET4: SC1 Mask               */

#define SCU_PNSSET4_SC2_Pos         ( 18 )                                                 /*!< SCU_T::PNSSET4: SC2 Position           */
#define SCU_PNSSET4_SC2_Msk         ( 0x1ul << SCU_PNSSET4_SC2_Pos )                       /*!< SCU_T::PNSSET4: SC2 Mask               */

#define SCU_PNSSET5_CAN0_Pos        ( 0 )                                                  /*!< SCU_T::PNSSET5: CAN0 Position          */
#define SCU_PNSSET5_CAN0_Msk        ( 0x1ul << SCU_PNSSET5_CAN0_Pos )                      /*!< SCU_T::PNSSET5: CAN0 Mask              */

#define SCU_PNSSET5_QEI0_Pos        ( 16 )                                                 /*!< SCU_T::PNSSET5: QEI0 Position          */
#define SCU_PNSSET5_QEI0_Msk        ( 0x1ul << SCU_PNSSET5_QEI0_Pos )                      /*!< SCU_T::PNSSET5: QEI0 Mask              */

#define SCU_PNSSET5_QEI1_Pos        ( 17 )                                                 /*!< SCU_T::PNSSET5: QEI1 Position          */
#define SCU_PNSSET5_QEI1_Msk        ( 0x1ul << SCU_PNSSET5_QEI1_Pos )                      /*!< SCU_T::PNSSET5: QEI1 Mask              */

#define SCU_PNSSET5_ECAP0_Pos       ( 20 )                                                 /*!< SCU_T::PNSSET5: ECAP0 Position         */
#define SCU_PNSSET5_ECAP0_Msk       ( 0x1ul << SCU_PNSSET5_ECAP0_Pos )                     /*!< SCU_T::PNSSET5: ECAP0 Mask             */

#define SCU_PNSSET5_ECAP1_Pos       ( 21 )                                                 /*!< SCU_T::PNSSET5: ECAP1 Position         */
#define SCU_PNSSET5_ECAP1_Msk       ( 0x1ul << SCU_PNSSET5_ECAP1_Pos )                     /*!< SCU_T::PNSSET5: ECAP1 Mask             */

#define SCU_PNSSET5_TRNG_Pos        ( 25 )                                                 /*!< SCU_T::PNSSET5: TRNG Position          */
#define SCU_PNSSET5_TRNG_Msk        ( 0x1ul << SCU_PNSSET5_TRNG_Pos )                      /*!< SCU_T::PNSSET5: TRNG Mask              */

#define SCU_PNSSET6_USBD_Pos        ( 0 )                                                  /*!< SCU_T::PNSSET6: USBD Position          */
#define SCU_PNSSET6_USBD_Msk        ( 0x1ul << SCU_PNSSET6_USBD_Pos )                      /*!< SCU_T::PNSSET6: USBD Mask              */

#define SCU_PNSSET6_USCI0_Pos       ( 16 )                                                 /*!< SCU_T::PNSSET6: USCI0 Position         */
#define SCU_PNSSET6_USCI0_Msk       ( 0x1ul << SCU_PNSSET6_USCI0_Pos )                     /*!< SCU_T::PNSSET6: USCI0 Mask             */

#define SCU_PNSSET6_USCI1_Pos       ( 17 )                                                 /*!< SCU_T::PNSSET6: USCI1 Position         */
#define SCU_PNSSET6_USCI1_Msk       ( 0x1ul << SCU_PNSSET6_USCI1_Pos )                     /*!< SCU_T::PNSSET6: USCI1 Mask             */

#define SCU_IONSSET_PA_Pos          ( 0 )                                                  /*!< SCU_T::IONSSET: PA Position            */
#define SCU_IONSSET_PA_Msk          ( 0x1ul << SCU_IONSSET_PA_Pos )                        /*!< SCU_T::IONSSET: PA Mask                */

#define SCU_IONSSET_PB_Pos          ( 1 )                                                  /*!< SCU_T::IONSSET: PB Position            */
#define SCU_IONSSET_PB_Msk          ( 0x1ul << SCU_IONSSET_PB_Pos )                        /*!< SCU_T::IONSSET: PB Mask                */

#define SCU_IONSSET_PC_Pos          ( 2 )                                                  /*!< SCU_T::IONSSET: PC Position            */
#define SCU_IONSSET_PC_Msk          ( 0x1ul << SCU_IONSSET_PC_Pos )                        /*!< SCU_T::IONSSET: PC Mask                */

#define SCU_IONSSET_PD_Pos          ( 3 )                                                  /*!< SCU_T::IONSSET: PD Position            */
#define SCU_IONSSET_PD_Msk          ( 0x1ul << SCU_IONSSET_PD_Pos )                        /*!< SCU_T::IONSSET: PD Mask                */

#define SCU_IONSSET_PE_Pos          ( 4 )                                                  /*!< SCU_T::IONSSET: PE Position            */
#define SCU_IONSSET_PE_Msk          ( 0x1ul << SCU_IONSSET_PE_Pos )                        /*!< SCU_T::IONSSET: PE Mask                */

