FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/scu_reg.h
#define SCU_IONSSET_PF_Pos          ( 5 )                                                  /*!< SCU_T::IONSSET: PF Position            */
#define SCU_IONSSET_PF_Msk          ( 0x1ul << SCU_IONSSET_PF_Pos )                        /*!< SCU_T::IONSSET: PF Mask                */

#define SCU_IONSSET_PG_Pos          ( 6 )                                                  /*!< SCU_T::IONSSET: PG Position            */
#define SCU_IONSSET_PG_Msk          ( 0x1ul << SCU_IONSSET_PG_Pos )                        /*!< SCU_T::IONSSET: PG Mask                */

#define SCU_IONSSET_PH_Pos          ( 7 )                                                  /*!< SCU_T::IONSSET: PH Position            */
#define SCU_IONSSET_PH_Msk          ( 0x1ul << SCU_IONSSET_PH_Pos )                        /*!< SCU_T::IONSSET: PH Mask                */

#define SCU_SRAMNSSET_SECn_Pos      ( 0 )                                                  /*!< SCU_T::SRAMNSSET: SECn Position        */
#define SCU_SRAMNSSET_SECn_Msk      ( 0xffful << SCU_SRAMNSSET_SECn_Pos )                  /*!< SCU_T::SRAMNSSET: SECn Mask            */

#define SCU_FNSADDR_FNSADDR_Pos     ( 0 )                                                  /*!< SCU_T::FNSADDR: FNSADDR Position       */
#define SCU_FNSADDR_FNSADDR_Msk     ( 0xfffffffful << SCU_FNSADDR_FNSADDR_Pos )            /*!< SCU_T::FNSADDR: FNSADDR Mask           */

#define SCU_SVIOIEN_APB0IEN_Pos     ( 0 )                                                  /*!< SCU_T::SVIOIEN: APB0IEN Position       */
#define SCU_SVIOIEN_APB0IEN_Msk     ( 0x1ul << SCU_SVIOIEN_APB0IEN_Pos )                   /*!< SCU_T::SVIOIEN: APB0IEN Mask           */

#define SCU_SVIOIEN_APB1IEN_Pos     ( 1 )                                                  /*!< SCU_T::SVIOIEN: APB1IEN Position       */
#define SCU_SVIOIEN_APB1IEN_Msk     ( 0x1ul << SCU_SVIOIEN_APB1IEN_Pos )                   /*!< SCU_T::SVIOIEN: APB1IEN Mask           */

#define SCU_SVIOIEN_GPIOIEN_Pos     ( 4 )                                                  /*!< SCU_T::SVIOIEN: GPIOIEN Position       */
#define SCU_SVIOIEN_GPIOIEN_Msk     ( 0x1ul << SCU_SVIOIEN_GPIOIEN_Pos )                   /*!< SCU_T::SVIOIEN: GPIOIEN Mask           */

#define SCU_SVIOIEN_EBIIEN_Pos      ( 5 )                                                  /*!< SCU_T::SVIOIEN: EBIIEN Position        */
#define SCU_SVIOIEN_EBIIEN_Msk      ( 0x1ul << SCU_SVIOIEN_EBIIEN_Pos )                    /*!< SCU_T::SVIOIEN: EBIIEN Mask            */

#define SCU_SVIOIEN_USBHIEN_Pos     ( 6 )                                                  /*!< SCU_T::SVIOIEN: USBHIEN Position       */
#define SCU_SVIOIEN_USBHIEN_Msk     ( 0x1ul << SCU_SVIOIEN_USBHIEN_Pos )                   /*!< SCU_T::SVIOIEN: USBHIEN Mask           */

#define SCU_SVIOIEN_CRCIEN_Pos      ( 7 )                                                  /*!< SCU_T::SVIOIEN: CRCIEN Position        */
#define SCU_SVIOIEN_CRCIEN_Msk      ( 0x1ul << SCU_SVIOIEN_CRCIEN_Pos )                    /*!< SCU_T::SVIOIEN: CRCIEN Mask            */

#define SCU_SVIOIEN_SDH0IEN_Pos     ( 8 )                                                  /*!< SCU_T::SVIOIEN: SDH0IEN Position       */
#define SCU_SVIOIEN_SDH0IEN_Msk     ( 0x1ul << SCU_SVIOIEN_SDH0IEN_Pos )                   /*!< SCU_T::SVIOIEN: SDH0IEN Mask           */

#define SCU_SVIOIEN_PDMA0IEN_Pos    ( 10 )                                                 /*!< SCU_T::SVIOIEN: PDMA0IEN Position      */
#define SCU_SVIOIEN_PDMA0IEN_Msk    ( 0x1ul << SCU_SVIOIEN_PDMA0IEN_Pos )                  /*!< SCU_T::SVIOIEN: PDMA0IEN Mask          */

#define SCU_SVIOIEN_PDMA1IEN_Pos    ( 11 )                                                 /*!< SCU_T::SVIOIEN: PDMA1IEN Position      */
#define SCU_SVIOIEN_PDMA1IEN_Msk    ( 0x1ul << SCU_SVIOIEN_PDMA1IEN_Pos )                  /*!< SCU_T::SVIOIEN: PDMA1IEN Mask          */

#define SCU_SVIOIEN_SRAM0IEN_Pos    ( 12 )                                                 /*!< SCU_T::SVIOIEN: SRAM0IEN Position      */
#define SCU_SVIOIEN_SRAM0IEN_Msk    ( 0x1ul << SCU_SVIOIEN_SRAM0IEN_Pos )                  /*!< SCU_T::SVIOIEN: SRAM0IEN Mask          */

#define SCU_SVIOIEN_SRAM1IEN_Pos    ( 13 )                                                 /*!< SCU_T::SVIOIEN: SRAM1IEN Position      */
#define SCU_SVIOIEN_SRAM1IEN_Msk    ( 0x1ul << SCU_SVIOIEN_SRAM1IEN_Pos )                  /*!< SCU_T::SVIOIEN: SRAM1IEN Mask          */

#define SCU_SVIOIEN_FMCIEN_Pos      ( 14 )                                                 /*!< SCU_T::SVIOIEN: FMCIEN Position        */
#define SCU_SVIOIEN_FMCIEN_Msk      ( 0x1ul << SCU_SVIOIEN_FMCIEN_Pos )                    /*!< SCU_T::SVIOIEN: FMCIEN Mask            */

#define SCU_SVIOIEN_FLASHIEN_Pos    ( 15 )                                                 /*!< SCU_T::SVIOIEN: FLASHIEN Position      */
#define SCU_SVIOIEN_FLASHIEN_Msk    ( 0x1ul << SCU_SVIOIEN_FLASHIEN_Pos )                  /*!< SCU_T::SVIOIEN: FLASHIEN Mask          */

#define SCU_SVIOIEN_SCUIEN_Pos      ( 16 )                                                 /*!< SCU_T::SVIOIEN: SCUIEN Position        */
#define SCU_SVIOIEN_SCUIEN_Msk      ( 0x1ul << SCU_SVIOIEN_SCUIEN_Pos )                    /*!< SCU_T::SVIOIEN: SCUIEN Mask            */

#define SCU_SVIOIEN_SYSIEN_Pos      ( 17 )                                                 /*!< SCU_T::SVIOIEN: SYSIEN Position        */
#define SCU_SVIOIEN_SYSIEN_Msk      ( 0x1ul << SCU_SVIOIEN_SYSIEN_Pos )                    /*!< SCU_T::SVIOIEN: SYSIEN Mask            */

#define SCU_SVIOIEN_CRPTIEN_Pos     ( 18 )                                                 /*!< SCU_T::SVIOIEN: CRPTIEN Position       */
#define SCU_SVIOIEN_CRPTIEN_Msk     ( 0x1ul << SCU_SVIOIEN_CRPTIEN_Pos )                   /*!< SCU_T::SVIOIEN: CRPTIEN Mask           */

#define SCU_SVINTSTS_APB0IF_Pos     ( 0 )                                                  /*!< SCU_T::SVINTSTS: APB0IF Position       */
#define SCU_SVINTSTS_APB0IF_Msk     ( 0x1ul << SCU_SVINTSTS_APB0IF_Pos )                   /*!< SCU_T::SVINTSTS: APB0IF Mask           */

#define SCU_SVINTSTS_APB1IF_Pos     ( 1 )                                                  /*!< SCU_T::SVINTSTS: APB1IF Position       */
#define SCU_SVINTSTS_APB1IF_Msk     ( 0x1ul << SCU_SVINTSTS_APB1IF_Pos )                   /*!< SCU_T::SVINTSTS: APB1IF Mask           */

#define SCU_SVINTSTS_GPIOIF_Pos     ( 4 )                                                  /*!< SCU_T::SVINTSTS: GPIOIF Position       */
#define SCU_SVINTSTS_GPIOIF_Msk     ( 0x1ul << SCU_SVINTSTS_GPIOIF_Pos )                   /*!< SCU_T::SVINTSTS: GPIOIF Mask           */

#define SCU_SVINTSTS_EBIIF_Pos      ( 5 )                                                  /*!< SCU_T::SVINTSTS: EBIIF Position        */
#define SCU_SVINTSTS_EBIIF_Msk      ( 0x1ul << SCU_SVINTSTS_EBIIF_Pos )                    /*!< SCU_T::SVINTSTS: EBIIF Mask            */

