FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/scu_reg.h
#define SCU_SVINTSTS_USBHIF_Pos     ( 6 )                                                  /*!< SCU_T::SVINTSTS: USBHIF Position       */
#define SCU_SVINTSTS_USBHIF_Msk     ( 0x1ul << SCU_SVINTSTS_USBHIF_Pos )                   /*!< SCU_T::SVINTSTS: USBHIF Mask           */

#define SCU_SVINTSTS_CRCIF_Pos      ( 7 )                                                  /*!< SCU_T::SVINTSTS: CRCIF Position        */
#define SCU_SVINTSTS_CRCIF_Msk      ( 0x1ul << SCU_SVINTSTS_CRCIF_Pos )                    /*!< SCU_T::SVINTSTS: CRCIF Mask            */

#define SCU_SVINTSTS_SDH0IF_Pos     ( 8 )                                                  /*!< SCU_T::SVINTSTS: SDH0IF Position       */
#define SCU_SVINTSTS_SDH0IF_Msk     ( 0x1ul << SCU_SVINTSTS_SDH0IF_Pos )                   /*!< SCU_T::SVINTSTS: SDH0IF Mask           */

#define SCU_SVINTSTS_PDMA0IF_Pos    ( 10 )                                                 /*!< SCU_T::SVINTSTS: PDMA0IF Position      */
#define SCU_SVINTSTS_PDMA0IF_Msk    ( 0x1ul << SCU_SVINTSTS_PDMA0IF_Pos )                  /*!< SCU_T::SVINTSTS: PDMA0IF Mask          */

#define SCU_SVINTSTS_PDMA1IF_Pos    ( 11 )                                                 /*!< SCU_T::SVINTSTS: PDMA1IF Position      */
#define SCU_SVINTSTS_PDMA1IF_Msk    ( 0x1ul << SCU_SVINTSTS_PDMA1IF_Pos )                  /*!< SCU_T::SVINTSTS: PDMA1IF Mask          */

#define SCU_SVINTSTS_SRAM0IF_Pos    ( 12 )                                                 /*!< SCU_T::SVINTSTS: SRAM0IF Position      */
#define SCU_SVINTSTS_SRAM0IF_Msk    ( 0x1ul << SCU_SVINTSTS_SRAM0IF_Pos )                  /*!< SCU_T::SVINTSTS: SRAM0IF Mask          */

#define SCU_SVINTSTS_SRAM1IF_Pos    ( 13 )                                                 /*!< SCU_T::SVINTSTS: SRAM1IF Position      */
#define SCU_SVINTSTS_SRAM1IF_Msk    ( 0x1ul << SCU_SVINTSTS_SRAM1IF_Pos )                  /*!< SCU_T::SVINTSTS: SRAM1IF Mask          */

#define SCU_SVINTSTS_FMCIF_Pos      ( 14 )                                                 /*!< SCU_T::SVINTSTS: FMCIF Position        */
#define SCU_SVINTSTS_FMCIF_Msk      ( 0x1ul << SCU_SVINTSTS_FMCIF_Pos )                    /*!< SCU_T::SVINTSTS: FMCIF Mask            */

#define SCU_SVINTSTS_FLASHIF_Pos    ( 15 )                                                 /*!< SCU_T::SVINTSTS: FLASHIF Position      */
#define SCU_SVINTSTS_FLASHIF_Msk    ( 0x1ul << SCU_SVINTSTS_FLASHIF_Pos )                  /*!< SCU_T::SVINTSTS: FLASHIF Mask          */

#define SCU_SVINTSTS_SCUIF_Pos      ( 16 )                                                 /*!< SCU_T::SVINTSTS: SCUIF Position        */
#define SCU_SVINTSTS_SCUIF_Msk      ( 0x1ul << SCU_SVINTSTS_SCUIF_Pos )                    /*!< SCU_T::SVINTSTS: SCUIF Mask            */

#define SCU_SVINTSTS_SYSIF_Pos      ( 17 )                                                 /*!< SCU_T::SVINTSTS: SYSIF Position        */
#define SCU_SVINTSTS_SYSIF_Msk      ( 0x1ul << SCU_SVINTSTS_SYSIF_Pos )                    /*!< SCU_T::SVINTSTS: SYSIF Mask            */

#define SCU_SVINTSTS_CRPTIF_Pos     ( 18 )                                                 /*!< SCU_T::SVINTSTS: CRPTIF Position       */
#define SCU_SVINTSTS_CRPTIF_Msk     ( 0x1ul << SCU_SVINTSTS_CRPTIF_Pos )                   /*!< SCU_T::SVINTSTS: CRPTIF Mask           */

#define SCU_APB0VSRC_MASTER_Pos     ( 0 )                                                  /*!< SCU_T::APB0VSRC: MASTER Position       */
#define SCU_APB0VSRC_MASTER_Msk     ( 0xful << SCU_APB0VSRC_MASTER_Pos )                   /*!< SCU_T::APB0VSRC: MASTER Mask           */

#define SCU_APB0VA_VIOADDR_Pos      ( 0 )                                                  /*!< SCU_T::APB0VA: VIOADDR Position        */
#define SCU_APB0VA_VIOADDR_Msk      ( 0xfffffffful << SCU_APB0VA_VIOADDR_Pos )             /*!< SCU_T::APB0VA: VIOADDR Mask            */

#define SCU_APB1VSRC_MASTER_Pos     ( 0 )                                                  /*!< SCU_T::APB1VSRC: MASTER Position       */
#define SCU_APB1VSRC_MASTER_Msk     ( 0xful << SCU_APB1VSRC_MASTER_Pos )                   /*!< SCU_T::APB1VSRC: MASTER Mask           */

#define SCU_APB1VA_VIOADDR_Pos      ( 0 )                                                  /*!< SCU_T::APB1VA: VIOADDR Position        */
#define SCU_APB1VA_VIOADDR_Msk      ( 0xfffffffful << SCU_APB1VA_VIOADDR_Pos )             /*!< SCU_T::APB1VA: VIOADDR Mask            */

#define SCU_GPIOVSRC_MASTER_Pos     ( 0 )                                                  /*!< SCU_T::GPIOVSRC: MASTER Position       */
#define SCU_GPIOVSRC_MASTER_Msk     ( 0xful << SCU_GPIOVSRC_MASTER_Pos )                   /*!< SCU_T::GPIOVSRC: MASTER Mask           */

#define SCU_GPIOVA_VIOADDR_Pos      ( 0 )                                                  /*!< SCU_T::GPIOVA: VIOADDR Position        */
#define SCU_GPIOVA_VIOADDR_Msk      ( 0xfffffffful << SCU_GPIOVA_VIOADDR_Pos )             /*!< SCU_T::GPIOVA: VIOADDR Mask            */

#define SCU_EBIVSRC_MASTER_Pos      ( 0 )                                                  /*!< SCU_T::EBIVSRC: MASTER Position        */
#define SCU_EBIVSRC_MASTER_Msk      ( 0xful << SCU_EBIVSRC_MASTER_Pos )                    /*!< SCU_T::EBIVSRC: MASTER Mask            */

#define SCU_EBIVA_VIOADDR_Pos       ( 0 )                                                  /*!< SCU_T::EBIVA: VIOADDR Position         */
#define SCU_EBIVA_VIOADDR_Msk       ( 0xfffffffful << SCU_EBIVA_VIOADDR_Pos )              /*!< SCU_T::EBIVA: VIOADDR Mask             */

#define SCU_USBHVSRC_MASTER_Pos     ( 0 )                                                  /*!< SCU_T::USBHVSRC: MASTER Position       */
#define SCU_USBHVSRC_MASTER_Msk     ( 0xful << SCU_USBHVSRC_MASTER_Pos )                   /*!< SCU_T::USBHVSRC: MASTER Mask           */

#define SCU_USBHVA_VIOADDR_Pos      ( 0 )                                                  /*!< SCU_T::USBHVA: VIOADDR Position        */
#define SCU_USBHVA_VIOADDR_Msk      ( 0xfffffffful << SCU_USBHVA_VIOADDR_Pos )             /*!< SCU_T::USBHVA: VIOADDR Mask            */

#define SCU_CRCVSRC_MASTER_Pos      ( 0 )                                                  /*!< SCU_T::CRCVSRC: MASTER Position        */
#define SCU_CRCVSRC_MASTER_Msk      ( 0xful << SCU_CRCVSRC_MASTER_Pos )                    /*!< SCU_T::CRCVSRC: MASTER Mask            */

#define SCU_CRCVA_VIOADDR_Pos       ( 0 )                                                  /*!< SCU_T::CRCVA: VIOADDR Position         */
#define SCU_CRCVA_VIOADDR_Msk       ( 0xfffffffful << SCU_CRCVA_VIOADDR_Pos )              /*!< SCU_T::CRCVA: VIOADDR Mask             */

#define SCU_SD0VSRC_MASTER_Pos      ( 0 )                                                  /*!< SCU_T::SD0VSRC: MASTER Position        */
#define SCU_SD0VSRC_MASTER_Msk      ( 0xful << SCU_SD0VSRC_MASTER_Pos )                    /*!< SCU_T::SD0VSRC: MASTER Mask            */

#define SCU_SD0VA_VIOADDR_Pos       ( 0 )                                                  /*!< SCU_T::SD0VA: VIOADDR Position         */
#define SCU_SD0VA_VIOADDR_Msk       ( 0xfffffffful << SCU_SD0VA_VIOADDR_Pos )              /*!< SCU_T::SD0VA: VIOADDR Mask             */

