FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/scu_reg.h
#define SCU_PDMA0VSRC_MASTER_Pos    ( 0 )                                                  /*!< SCU_T::PDMA0VSRC: MASTER Position      */
#define SCU_PDMA0VSRC_MASTER_Msk    ( 0xful << SCU_PDMA0VSRC_MASTER_Pos )                  /*!< SCU_T::PDMA0VSRC: MASTER Mask          */

#define SCU_PDMA0VA_VIOADDR_Pos     ( 0 )                                                  /*!< SCU_T::PDMA0VA: VIOADDR Position       */
#define SCU_PDMA0VA_VIOADDR_Msk     ( 0xfffffffful << SCU_PDMA0VA_VIOADDR_Pos )            /*!< SCU_T::PDMA0VA: VIOADDR Mask           */

#define SCU_PDMA1VSRC_MASTER_Pos    ( 0 )                                                  /*!< SCU_T::PDMA1VSRC: MASTER Position      */
#define SCU_PDMA1VSRC_MASTER_Msk    ( 0xful << SCU_PDMA1VSRC_MASTER_Pos )                  /*!< SCU_T::PDMA1VSRC: MASTER Mask          */

#define SCU_PDMA1VA_VIOADDR_Pos     ( 0 )                                                  /*!< SCU_T::PDMA1VA: VIOADDR Position       */
#define SCU_PDMA1VA_VIOADDR_Msk     ( 0xfffffffful << SCU_PDMA1VA_VIOADDR_Pos )            /*!< SCU_T::PDMA1VA: VIOADDR Mask           */

#define SCU_SRAM0VSRC_MASTER_Pos    ( 0 )                                                  /*!< SCU_T::SRAM0VSRC: MASTER Position      */
#define SCU_SRAM0VSRC_MASTER_Msk    ( 0xful << SCU_SRAM0VSRC_MASTER_Pos )                  /*!< SCU_T::SRAM0VSRC: MASTER Mask          */

#define SCU_SRAM0VA_VIOADDR_Pos     ( 0 )                                                  /*!< SCU_T::SRAM0VA: VIOADDR Position       */
#define SCU_SRAM0VA_VIOADDR_Msk     ( 0xfffffffful << SCU_SRAM0VA_VIOADDR_Pos )            /*!< SCU_T::SRAM0VA: VIOADDR Mask           */

#define SCU_SRAM1VSRC_MASTER_Pos    ( 0 )                                                  /*!< SCU_T::SRAM1VSRC: MASTER Position      */
#define SCU_SRAM1VSRC_MASTER_Msk    ( 0xful << SCU_SRAM1VSRC_MASTER_Pos )                  /*!< SCU_T::SRAM1VSRC: MASTER Mask          */

#define SCU_SRAM1VA_VIOADDR_Pos     ( 0 )                                                  /*!< SCU_T::SRAM1VA: VIOADDR Position       */
#define SCU_SRAM1VA_VIOADDR_Msk     ( 0xfffffffful << SCU_SRAM1VA_VIOADDR_Pos )            /*!< SCU_T::SRAM1VA: VIOADDR Mask           */

#define SCU_FMCVSRC_MASTER_Pos      ( 0 )                                                  /*!< SCU_T::FMCVSRC: MASTER Position        */
#define SCU_FMCVSRC_MASTER_Msk      ( 0xful << SCU_FMCVSRC_MASTER_Pos )                    /*!< SCU_T::FMCVSRC: MASTER Mask            */

#define SCU_FMCVA_VIOADDR_Pos       ( 0 )                                                  /*!< SCU_T::FMCVA: VIOADDR Position         */
#define SCU_FMCVA_VIOADDR_Msk       ( 0xfffffffful << SCU_FMCVA_VIOADDR_Pos )              /*!< SCU_T::FMCVA: VIOADDR Mask             */

#define SCU_FLASHVSRC_MASTER_Pos    ( 0 )                                                  /*!< SCU_T::FLASHVSRC: MASTER Position      */
#define SCU_FLASHVSRC_MASTER_Msk    ( 0xful << SCU_FLASHVSRC_MASTER_Pos )                  /*!< SCU_T::FLASHVSRC: MASTER Mask          */

#define SCU_FLASHVA_VIOADDR_Pos     ( 0 )                                                  /*!< SCU_T::FLASHVA: VIOADDR Position       */
#define SCU_FLASHVA_VIOADDR_Msk     ( 0xfffffffful << SCU_FLASHVA_VIOADDR_Pos )            /*!< SCU_T::FLASHVA: VIOADDR Mask           */

#define SCU_SCUVSRC_MASTER_Pos      ( 0 )                                                  /*!< SCU_T::SCUVSRC: MASTER Position        */
#define SCU_SCUVSRC_MASTER_Msk      ( 0xful << SCU_SCUVSRC_MASTER_Pos )                    /*!< SCU_T::SCUVSRC: MASTER Mask            */

#define SCU_SCUVA_VIOADDR_Pos       ( 0 )                                                  /*!< SCU_T::SCUVA: VIOADDR Position         */
#define SCU_SCUVA_VIOADDR_Msk       ( 0xfffffffful << SCU_SCUVA_VIOADDR_Pos )              /*!< SCU_T::SCUVA: VIOADDR Mask             */

#define SCU_SYSVSRC_MASTER_Pos      ( 0 )                                                  /*!< SCU_T::SYSVSRC: MASTER Position        */
#define SCU_SYSVSRC_MASTER_Msk      ( 0xful << SCU_SYSVSRC_MASTER_Pos )                    /*!< SCU_T::SYSVSRC: MASTER Mask            */

#define SCU_SYSVA_VIOADDR_Pos       ( 0 )                                                  /*!< SCU_T::SYSVA: VIOADDR Position         */
#define SCU_SYSVA_VIOADDR_Msk       ( 0xfffffffful << SCU_SYSVA_VIOADDR_Pos )              /*!< SCU_T::SYSVA: VIOADDR Mask             */

#define SCU_CRPTVSRC_MASTER_Pos     ( 0 )                                                  /*!< SCU_T::CRPTVSRC: MASTER Position       */
#define SCU_CRPTVSRC_MASTER_Msk     ( 0xful << SCU_CRPTVSRC_MASTER_Pos )                   /*!< SCU_T::CRPTVSRC: MASTER Mask           */

#define SCU_CRPTVA_VIOADDR_Pos      ( 0 )                                                  /*!< SCU_T::CRPTVA: VIOADDR Position        */
#define SCU_CRPTVA_VIOADDR_Msk      ( 0xfffffffful << SCU_CRPTVA_VIOADDR_Pos )             /*!< SCU_T::CRPTVA: VIOADDR Mask            */

#define SCU_NSMCTL_PRESCALE_Pos     ( 0 )                                                  /*!< SCU_T::NSMCTL: PRESCALE Position       */
#define SCU_NSMCTL_PRESCALE_Msk     ( 0xfful << SCU_NSMCTL_PRESCALE_Pos )                  /*!< SCU_T::NSMCTL: PRESCALE Mask           */

#define SCU_NSMCTL_NSMIEN_Pos       ( 8 )                                                  /*!< SCU_T::NSMCTL: NSMIEN Position         */
#define SCU_NSMCTL_NSMIEN_Msk       ( 0x1ul << SCU_NSMCTL_NSMIEN_Pos )                     /*!< SCU_T::NSMCTL: NSMIEN Mask             */

#define SCU_NSMCTL_AUTORLD_Pos      ( 9 )                                                  /*!< SCU_T::NSMCTL: AUTORLD Position        */
#define SCU_NSMCTL_AUTORLD_Msk      ( 0x1ul << SCU_NSMCTL_AUTORLD_Pos )                    /*!< SCU_T::NSMCTL: AUTORLD Mask            */

#define SCU_NSMCTL_TMRMOD_Pos       ( 10 )                                                 /*!< SCU_T::NSMCTL: TMRMOD Position         */
#define SCU_NSMCTL_TMRMOD_Msk       ( 0x1ul << SCU_NSMCTL_TMRMOD_Pos )                     /*!< SCU_T::NSMCTL: TMRMOD Mask             */

#define SCU_NSMCTL_IDLEON_Pos       ( 12 )                                                 /*!< SCU_T::NSMCTL: IDLEON Position         */
#define SCU_NSMCTL_IDLEON_Msk       ( 0x1ul << SCU_NSMCTL_IDLEON_Pos )                     /*!< SCU_T::NSMCTL: IDLEON Mask             */

#define SCU_NSMCTL_DBGON_Pos        ( 13 )                                                 /*!< SCU_T::NSMCTL: DBGON Position          */
#define SCU_NSMCTL_DBGON_Msk        ( 0x1ul << SCU_NSMCTL_DBGON_Pos )                      /*!< SCU_T::NSMCTL: DBGON Mask              */

#define SCU_NSMLOAD_RELOAD_Pos      ( 0 )                                                  /*!< SCU_T::NSMLOAD: RELOAD Position        */
#define SCU_NSMLOAD_RELOAD_Msk      ( 0xfffffful << SCU_NSMLOAD_RELOAD_Pos )               /*!< SCU_T::NSMLOAD: RELOAD Mask            */

#define SCU_NSMVAL_VALUE_Pos        ( 0 )                                                  /*!< SCU_T::NSMVAL: VALUE Position          */
#define SCU_NSMVAL_VALUE_Msk        ( 0xfffffful << SCU_NSMVAL_VALUE_Pos )                 /*!< SCU_T::NSMVAL: VALUE Mask              */

#define SCU_NSMSTS_CURRNS_Pos       ( 0 )                                                  /*!< SCU_T::NSMSTS: CURRNS Position         */
#define SCU_NSMSTS_CURRNS_Msk       ( 0x1ul << SCU_NSMSTS_CURRNS_Pos )                     /*!< SCU_T::NSMSTS: CURRNS Mask             */

#define SCU_NSMSTS_NSMIF_Pos        ( 1 )                                                  /*!< SCU_T::NSMSTS: NSMIF Position          */
#define SCU_NSMSTS_NSMIF_Msk        ( 0x1ul << SCU_NSMSTS_NSMIF_Pos )                      /*!< SCU_T::NSMSTS: NSMIF Mask              */

/**@}*/ /* SCU_CONST */
/**@}*/ /* end of SCU register group */
/**@}*/ /* end of REGISTER group */


#endif /* __SCU_REG_H__ */
